app/Controllers/Admin.php

SELECT *, `form_p3`.`id` as `p3_id`
FROM `form_p3`
JOIN `pemohon` ON `pemohon`.`id` = `form_p3`.`pemohon_id`
---
    public function index()
    {
        $db = \Config\Database::connect();
        $status = $this->request->getGet('status') ?? 'all';
        $builder = $db->table('form_p3');
        $builder->select('*');
        $builder->select('form_p3.id as p3_id');
        if ($status != 'all') {
            $builder->where('status', $status);
        }
        $builder->join('pemohon', 'pemohon.id = form_p3.pemohon_id');
        $data = $builder->get();

SELECT *
FROM `form_p3`
WHERE `form_p3`.`id` = '58'
DELETE FROM `verifikasi`
WHERE `pemohon_id` = '58'
DELETE FROM `form_p3`
WHERE `id` = '58'
DELETE FROM `pemohon`
WHERE `id` = '58'
---
    public function p3Delete($id)
    {
        $db = \Config\Database::connect();

        // Check if the record with the given ID exists in the 'form_p3' table
        $builder = $db->table('form_p3');
        $builder->select('*');
        $builder->where('form_p3.id', $id);
        $record = $builder->get()->getRow();

        if ($record) {

            $imgFile = 'berkas/ktp/' . $record->foto_ktp;
            $pdfFile = 'berkas/permohonan/' . $record->file_permohonan;

            if (file_exists($imgFile)) {
                unlink($imgFile);
            }

            if (file_exists($pdfFile)) {
                unlink($pdfFile);
            }

            // First, delete associated records in the 'verifikasi' table
            $verifikasiBuilder = $db->table('verifikasi');
            $verifikasiBuilder->where('pemohon_id', $record->pemohon_id);
            $verifikasiBuilder->delete();

            // Then, delete the record in the 'form_p3' table
            $db->table('form_p3')->where('id', $id)->delete();

            $pemohonID = $record->pemohon_id;
            $db->table('pemohon')->where('id', $pemohonID)->delete();