app/Controllers/Home.php

SELECT *, `verifikasi`.`id` as `id_verifikasi`
FROM `verifikasi`
JOIN `form_p3` ON `verifikasi`.`pemohon_id` = `form_p3`.`pemohon_id`
JOIN `pemohon` ON `verifikasi`.`pemohon_id` = `pemohon`.`id`
JOIN `admin` ON `verifikasi`.`adminid` = `admin`.`adminid`
---
    public function cekStatusDokumen() {

        $db = \Config\Database::connect();
        $status = $this->request->getGet('status') ?? 'all';
        $builder = $db->table('verifikasi');
        $builder->select('*');
        $builder->select('verifikasi.id as id_verifikasi');
        if($status!='all'){
            $builder->where('status', $status);
        }
        $builder->join('form_p3', 'verifikasi.pemohon_id = form_p3.pemohon_id');
        $builder->join('pemohon', 'verifikasi.pemohon_id = pemohon.id');
        $builder->join('admin', 'verifikasi.adminid = admin.adminid');
        $data = $builder->get()->getResultArray();

INSERT INTO `pemohon` (`nama`, `nik`, `email`, `tempat_lahir`, `tanggal_lahir`, `no_hp`, `alamat`, `pekerjaan`) VALUES ('Madani Shofa', '41231231233213123123', 'wildan@gmail.com', 'Sulawesi', '2023-10-23', '081228438495', 'Jl. Manggis', 'Pengangguran')
---
            session()->setFlashdata($sess_Pesan);
            return redirect()->to('/form');
        } else {
        $db->table('pemohon')->insert($pemohon);

INSERT INTO `form_p3` (`pemohon_id`, `kdpermohonan`, `foto_ktp`, `file_permohonan`) VALUES (59, 'P7021223435                    ', '1697582343_13d8524be03857dd3920.jpg', '1697582343_1a7eac020360a257165a.pdf')
---
            'foto_ktp' => $fileName1,
            'file_permohonan' => $fileName2,
        ];
        $db->table('form_p3')->insert($form);

INSERT INTO `verifikasi` (`pemohon_id`) VALUES (59)
---
        $ids = [
            'pemohon_id' => $pemohon_id,
        ];
        $db->table('verifikasi')->insert($ids);